package org.future.code.homework;

public class HomeWork7 {
    /**
     * 1. Написать свой метод для сравнения строк, который принимает две строки, а возвращает значение типа Boolean
     *
     * 2. Генерируется набор случайных чисел. С помощью Stream API определить количество нечётных чисел.
     *
     * 3. Задано множество слов. Пользователь вводит букву.
     *      С помощью Stream API вывести все слова, начинающиеся на эту букву.
     */
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
